<?php

return [

    /*
    |------------------------------------------------- -------------------------
    | Table Columns
    |------------------------------------------------- -------------------------
    */

    'column.guard_name' => 'Имя гварда',
    'column.name' => 'Имя',
    'column.permissions' => 'Разрешения',
    'column.roles' => 'Роли',
    'column.team' => 'Команда',
    'column.updated_at' => 'Обновлено',

    /*
    |------------------------------------------------- -------------------------
    | Form Fields
    |------------------------------------------------- -------------------------
    */

    'field.guard_name' => 'Имя гварда',
    'field.name' => 'Имя',
    'field.permissions' => 'Разрешения',
    'field.select_all.message' => 'Включить все разрешения, которые <span class="text-primary font-medium">Доступны</span> для этой роли',
    'field.select_all.name' => 'Выбрать все',
    'field.team' => 'Команда',
    'field.team.placeholder' => 'Выберите команду ...',

    /*
    |------------------------------------------------- -------------------------
    | Navigation & Resource
    |------------------------------------------------- -------------------------
    */

    'nav.group' => 'Filament Shield',
    'nav.role.icon' => 'heroicon-o-shield-check',
    'nav.role.label' => 'Роли',
    'resource.label.role' => 'Роль',
    'resource.label.roles' => 'Роли',

    /*
    |------------------------------------------------- -------------------------
    | Section & Tabs
    |------------------------------------------------- -------------------------
    */

    'custom' => 'Пользовательские разрешения',
    'pages' => 'Страницы',
    'resources' => 'Ресурсы',
    'section' => 'Сути',
    'widgets' => 'Виджеты',

    /*
    |------------------------------------------------- -------------------------
    | Messages
    |------------------------------------------------- -------------------------
    */

    'forbidden' => 'У вас нет доступа',

    /*
    |------------------------------------------------- -------------------------
    | Resource Permissions' Labels
    |------------------------------------------------- -------------------------
    */

    'resource_permission_prefixes_labels' => [
        'create' => 'Создание',
        'delete' => 'Удаление',
        'delete_any' => 'Может удалить любой',
        'force_delete' => 'Принудительно удалить',
        'force_delete_any' => 'Может принудительно удалить любой',
        'reorder' => 'Изменение порядка',
        'replicate' => 'Копировать',
        'restore' => 'Восстановление',
        'restore_any' => 'Может восстановить любой',
        'update' => 'Обновление',
        'view' => 'Просмотр',
        'view_any' => 'Может смотреть любое',
    ],

];
